src/cfe/КСП/Catalogs/КСП_ВидыОперацийПоСкладамУПП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>КСП_ВидыОперацийПоСкладамУПП</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СкладУПП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КСП_СкладыУПП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладЕРП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогикаОбработкиВШапке</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КСП_ЛогикаОбработкиДвиженияПоСкладуУПП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Отправители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КСП_СкладыУПП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛогикаОбработкиВТЧ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КСП_ЛогикаОбработкиДвиженияПоСкладуУПП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Получатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КСП_СкладыУПП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛогикаОбработкиВТЧ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КСП_ЛогикаОбработкиДвиженияПоСкладуУПП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/КСП/Catalogs/КСП_ВидыОперацийПоСкладамУПП/Ext/ManagerModule.bsl
// Описание_метода
//
// Параметры:
//	СкладУПП 	- гуид (строка) или спр ссылка КСП_СкладыУПП - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция ПоМэппингу(СкладУПП) Экспорт
	
	Если ТипЗнч(СкладУПП) = Тип("Строка") Тогда
		_СкладУПП = Справочники.КСП_СкладыУПП.ПолучитьСсылку(Новый УникальныйИдентификатор(СкладУПП));
		
	Иначе 
		_СкладУПП = СкладУПП;
	КонецЕсли;	
	
	Рез = Справочники.КСП_ВидыОперацийПоСкладамУПП.НайтиПоРеквизиту("СкладУПП", _СкладУПП);
	Если ЗначениеЗаполнено(Рез) Тогда
		Возврат Рез.СкладЕРП;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции
